backend_ruby/gestor_de_militares_api/app/controllers/militars_controller.rb

SELECT "militars".* FROM "militars" WHERE "militars"."usuario" = ?  [["usuario", "Jose"]]
SELECT COUNT(*) FROM "militars" WHERE "militars"."usuario" = ?  [["usuario", "Jose"]]
---
  def index
    @militares = Militar.where(usuario: params[:usuario])
    # @militares = Militar.all
    logger.info "Cargando militares para usuario: #{params[:usuario]}, Total: #{@militares.count}"

INSERT INTO "militars" ("nombre", "oficial", "usuario", "nombre_superior", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["nombre", "of1"], ["oficial", 1], ["usuario", nil], ["nombre_superior", "Capitan equipo1"], ["created_at", "2024-05-22 10:16:34.184204"], ["updated_at", "2024-05-22 10:16:34.184204"]]
---
  def create
    @militar = Militar.new(militar_params)##.merge(usuario: params[:usuario])
    if @militar.save

SELECT "militars".* FROM "militars" WHERE "militars"."usuario" = ? AND "militars"."nombre" = ? LIMIT ?  [["usuario", "David"], ["nombre", "raso3"], ["LIMIT", 1]]
UPDATE "militars" SET "nombre_superior" = ?, "updated_at" = ? WHERE "militars"."id" = ?  [["nombre_superior", ""], ["updated_at", "2024-05-22 19:30:24.325378"], ["id", 28]]
---
  def update
    @militar = Militar.find_by(usuario: params[:usuario], nombre: params[:nombre])
    if @militar.update(militar_params)

SELECT "militars".* FROM "militars" WHERE "militars"."nombre" = ? AND "militars"."usuario" = ? LIMIT ?  [["nombre", "of11"], ["usuario", "Jose"], ["LIMIT", 1]]
DELETE FROM "militars" WHERE "militars"."id" = ?  [["id", 23]]
---
  def destroy
    # militar = Militar.where(usuario: params[:usuario]).find_by(params[:nombre])
    militar = Militar.find_by(nombre: params[:nombre], usuario: params[:usuario])

    if militar.destroy